app/controllers/artwork_collections_controller.rb

SELECT  "artwork_collections".* FROM "artwork_collections" WHERE "artwork_collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "artwork_collections".* FROM "artwork_collections"
---
  def index

    if params[:user_id]
      artcollection = ArtworkCollection.find(params[:user_id])
      collections = artcollection.artworks
    else
      artcollections = ArtworkCollection.all