app/controllers/artworks_controller.rb

  def index
    if params[:user_id]
      user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
    artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Chinese Democracy"], ["updated_at", "2020-02-26 22:22:21.896954"], ["id", 5]]

  def destroy
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def favorite
    artwork = Artwork.find_by(id: params[:id])
    artwork.favorited = true
    artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorited", true], ["updated_at", "2020-02-27 21:44:08.914369"], ["id", 2]]

  def unfavorite
    artwork = Artwork.find_by(id: params[:id])
    artwork.favorited = false
    artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorited", false], ["updated_at", "2020-02-27 21:44:15.646812"], ["id", 2]]