app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      comments = user.comments
    elsif params[:artwork_id]
      artwork = Artwork.find(params[:artwork_id])
      comments = artwork.comments
    else
      comments = Comment.all

INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["artwork_id", 4], ["body", "This album doesn't get enough love."]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save