app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      likes = user.likes
    elsif params[:artwork_id]
      artwork = Artwork.find(params[:artwork_id])
      likes = artwork.likes
    elsif params[:comment_id]
      comment = Comment.find(params[:comment_id])
      likes = comment.likes
    else
      likes = Like.all

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_type", "Comment"], ["likeable_id", 5], ["created_at", "2020-02-27 20:07:22.602531"], ["updated_at", "2020-02-27 20:07:22.602531"]]
---
  def create
    like = Like.new(like_params)
    if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    like = Like.find(params[:id])

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "likes" SET "likeable_id" = $1, "updated_at" = $2 WHERE "likes"."id" = $3  [["likeable_id", 4], ["updated_at", "2020-02-27 20:14:06.022801"], ["id", 3]]
---
  def update
    like = Like.find(params[:id])
    like.update!(like_params)

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    like = Like.find(params[:id])
    like.destroy