app/controllers/users_controller.rb

  def index
    if params[:username]
      #WHERE username LIKE '%Steven Adler%'
      users = User.where("username LIKE ?", "%#{params[:username]}%")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '''%Steven%''')
SELECT "users".* FROM "users" WHERE (username = 'Slash')

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "yoyo123@gmail.com"], ["name", "Stan Smith"], ["created_at", "2020-02-26 19:46:43.039139"], ["updated_at", "2020-02-26 19:46:43.039139"]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "aaaarrgghhhh!!!!@gmail.com"], ["name", "fred rogers"], ["updated_at", "2020-02-26 20:02:29.793821"], ["id", 3]]